{
  "name": "RegexpOnFilename",
  "language": "java",
  "description": "<div>\n Checks that a specified pattern matches based on file and/or folder path.\n It can also be used to verify files\n match specific naming patterns not covered by other checks (Ex: properties,\n xml, etc.).\n </div>\n\n <p>\n When customizing the check, the properties are applied in a specific order.\n The fileExtensions property first picks only files that match any of the\n specific extensions supplied. Once files are matched against the\n fileExtensions, the match property is then used in conjunction with the\n patterns to determine if the check is looking for a match or mismatch on\n those files. If the fileNamePattern is supplied, the matching is only applied\n to the fileNamePattern and not the folderPattern. If no fileNamePattern is\n supplied, then matching is applied to the folderPattern only and will result\n in all files in a folder to be reported on violations. If no folderPattern is\n supplied, then all folders that checkstyle finds are examined for violations.\n The ignoreFileNameExtensions property drops the file extension and applies\n the fileNamePattern only to the rest of file name. For example, if the file\n is named 'test.java' and this property is turned on, the pattern is only\n applied to 'test'.\n </p>\n\n <p>\n If this check is configured with no properties, then the default behavior of\n this check is to report file names with spaces in them. When at least one\n pattern property is supplied, the entire check is under the user's control to\n allow them to fully customize the behavior.\n </p>\n\n <p>\n It is recommended that if you create your own pattern, to also specify a\n custom violation message. This allows the violation message printed to be clear what\n the violation is, especially if multiple RegexpOnFilename checks are used.\n Argument 0 for the message populates the check's folderPattern. Argument 1\n for the message populates the check's fileNamePattern. The file name is not\n passed as an argument since it is part of CheckStyle's default violation\n messages.\n </p>",
  "example": null,
  "cwe": null,
  "cwe-description": null,
  "checker-language": "java",
  "loc": 94,
  "branches": 7,
  "apis": 24,
  "test": []
}