{
  "name": "NewlineAtEndOfFile",
  "language": "java",
  "description": "<div>\n Checks whether files end with a line separator.\n </div>\n\n <p>\n Rationale: Any not empty source files and text files in general should end with a line\n separator to let other easily add new content at the end of file and \"diff\"\n command does not show previous lines as changed.\n </p>\n\n <p>\n Example (the line with 'No newline at end of file' should not be in the diff):\n </p>\n <pre>\n &#64;&#64; -32,4 +32,5 &#64;&#64; ForbidWildcardAsReturnTypeCheck.returnTypeClassNamesIgnoreRegex\n PublicReferenceToPrivateTypeCheck.name = Public Reference To Private Type\n\n StaticMethodCandidateCheck.name = Static Method Candidate\n -StaticMethodCandidateCheck.desc = Checks whether private methods should be declared as static.\n \\ No newline at end of file\n +StaticMethodCandidateCheck.desc = Checks whether private methods should be declared as static.\n +StaticMethodCandidateCheck.skippedMethods = Method names to skip during the check.\n </pre>\n\n <p>\n It can also trick the VCS to report the wrong owner for such lines.\n An engineer who has added nothing but a newline character becomes the last\n known author for the entire line. As a result, a mate can ask him a question\n to which he will not give the correct answer.\n </p>\n\n <p>\n Old Rationale: CVS source control management systems will even print\n a warning when it encounters a file that doesn't end with a line separator.\n </p>\n\n <p>\n Attention: property fileExtensions works with files that are passed by similar\n property for at <a href=\"https://checkstyle.org/config.html#Checker\">Checker</a>.\n Please make sure required file extensions are mentioned at Checker's fileExtensions property.\n </p>\n\n <p>\n This will check against the platform-specific default line separator.\n </p>\n\n <p>\n It is also possible to enforce the use of a specific line-separator across\n platforms, with the {@code lineSeparator} property.\n </p>",
  "example": null,
  "cwe": null,
  "cwe-description": null,
  "checker-language": "java",
  "loc": 63,
  "branches": 5,
  "apis": 18,
  "test": []
}